PeterVranken/DEVKIT-MPC5748G/samples/TCP/code/system/RTOS/rtos_systemMemoryProtectionUnit.c
/**
 * @file rtos_systemMemoryProtectionUnit.c
 * Configuration and initialization of the Memory Protection Unit (MPU). The
 * configuration is chosen static in this sample. The initially chosen configuration is
 * never changed during run-time.\n
 *   The configuration uses a descriptor for all ROM, which is occupied by the compiled
 * code: All processes have read and execution access. Write access, although it can't do
 * any harm is forbidden: According run-time failure reporting will point to definite
 * implementation errors.\n
 *   The configuration has one descriptor for all RAM, which is occupied by the compiled
 * code. All processes have read access and only the OS process has write and execute
 * access, too.\n
 *   The configuration has one descriptor for the entire peripheral address space. The OS
 * process has read and write access.\n
 *   Each of the four user processes has three descriptors, all of them for RAM write and
 * execute access. There's a descriptor for the initialized data and bss, one for the small
 * data and bss and one for the small data 2 and bss 2.\n
 *   The configuration has one descriptor for a chunk of memory, which all user processes
 * have read and write access to. This memory is meant for inter-process communication and
 * must evidently never be used to hold data, which is essential for the health of a
 * process and in particular for the process, that implements supervisory safety tasks.\n
 *   The static configuration of the MPU is the explanation for the fixed number of four
 * supported processes (#RTOS_NO_PROCESSES). For the partitioning of the RAM space, we need
 * three descriptors per user process and one for the OS and we have 16 descriptors
 * available. From the remaining three, we have spend one for shared data. Two descriptors
 * are still available.\n
 *   CAUTION: The mentioned memory chunks or areas are puzzled by the linker. The MPU
 * configuration makes no hard coded assumptions about memory arrangement and distribution
 * or addresses and sizes of the chunks. It reads address and length of the memory chunks
 * from linker provided symbols. Insofar do we have a very tight relationship between the
 * implementation of this module and the linker script, which must be obeyed when doing
 * maintenance work at either side.
 *
 * Alternative configurations, which may find their use case and do not break the safety
 * concept:
 *   - The OS process doesn't necessarily need execution access for RAM. There
 * are typically driver implementation patterns, which require RAM execution rights, but it
 * is mostly about initialization and could be done prior to calling the MPU configuration.\n
 *   - The user processes won't normally need execution rights for their RAM\n
 *   - It is possible to let a process with higher privileges have access to the memories
 * of all processes with lower privileges. Below, it is explained how to do this\n
 *   - If the number of processes is reduced (a safety concept requires two processes at
 * minimum) then each process could have up to six descriptors. This would enable a
 * configuration with disjunct small data and bss chunks so that the waste of data image
 * ROM disappears, which the current configuration has (see linker script for details)\n
 *   - The shared memory section can be disabled if not required for the inter-process
 * communication\n
 *   - A fifth process could be defined using the unused descriptors. Most code barely
 * makes use of SDA2 and since we mostly use explicit data object placing it's definitely
 * not essential. This way it would even be possible to define up to seven processes, each
 * using two descriptors.\n
 *   - A difficult topic is the placing of the small data 2 and bss 2 sections. It is
 * possible to locate them into the ROM. This is likely not fully compliant with the EABI
 * but for all normal embedded applications alright. In which case we had four free
 * descriptors and could implement two more processes. A similar concept for increasing the
 * number of processes would be entirely switching off the short addressing modes. This is a
 * matter of the compiler command line
 *
 * Copyright (C) 2018-2023 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or (at your
 * option) any later version.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
 * General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   rtos_osInitMPU
 *   rtos_checkUserCodeWritePtr
 * Local functions
 *   writeRAMAreaDescriptor
 */

/*
 * Include files
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <assert.h>

#include "MPC5748G.h"
#include "typ_types.h"

#include "rtos.h"
#include "rtos_kernelInstanceData.h"
#include "rtos_systemMemoryProtectionUnit.h"


/*
 * Defines
 */

/** Development support: If this define is set to one than the entire RAM is writable for
    all processes. */
#define RTOS_DISARM_RAM_MPU     0


/*
 * Local type definitions
 */


/*
 * Local prototypes
 */


/*
 * Data definitions
 */


/*
 * Function implementation
 */

/**
 * Configure and initialize the memory protection units SMPU_0 and SMPU_1. The
 * configuration is static; a set of regions suitable for the RTOS (and its project
 * dependent configuration) is defined and then the unit is enabled.\n
 *   See module description for more details.
 *   @remark
 * The processes are shared between the cores and, as a consequence, one static MPU
 * configuration is used to control the behavior of all three cores. Regardless, how many
 * cores are run, this function must be called only once and it must be called when the
 * first of the three cores starts up.
 */
void rtos_osInitMPU(void)
{
    /* This function must not be used repeatedly during system initialization. See RM
       21.3.1, p. 491: GVLD should still be in reset state, SMPU disabled. */
    assert((SMPU_0->CES0 & SMPU_CES0_GVLD_MASK) == 0
           &&  (SMPU_1->CES0 & SMPU_CES0_GVLD_MASK) == 0
          );

