PeterVranken/DEVKIT-MPC5748G/samples/TCP/code/system/RTOS/rtos_systemMemoryProtectionUnit.c
    /* RM, 21.1, table 21-1, p. 475f: SMPU0 handles PFLASH, PBRIDGE_A, PBRIDGE_B accessed
       by XBAR0 masters plus debug interfaces. The connected masters are:
         Z4a (M0), Z4b (M1), Z2 (M2), HSM (M3), DMA (M4), Z4a debug (M8), Z4b debug (M9),
       Z2 debug (M10)
         SMPU1 handles all 3 SRAM blocks accessed by XBAR1 masters plus debug interfaces.
       The connected masters are:
         Z4a (M0), Z4b (M1), Z2 (M2), HSM (M3), DMA (M4), Ethernet0 (M5), FlexRay(M6), MLB
       (M7), Z4a debug (M8), Z4b debug (M9), Z2 debug (M10), USB0 (M11), USB1 (M12), uSDHC
       (M13), Ethernet1 (M14) */

    /* All regions grant the same access to all relevant bus masters. The access word (we
       use format 1) has two bits for each master which form the index to select one out of
       three possible combinations of read/write/execute right for supervisor and user mode.
       For RAM (protected by SMPU_1) we use three access right patterns:
         - rwx for SV and r for U       (all used RAM and for all user processes)
         - rwx for SV and rwx for U     (process owned RAM, decided by PID)
         - rwx for SV and rw for U      (shared RAM and for all user processes)
       For ROM and peripherals (protected by SMPU_1) we need:
         - rx for SV and for U          (all used ROM)
         - rw for SV, no access for U   (peripherals)
         The access pattern is defined by six bits in this order: SVR, SVW, SVX, UR, UW,
       UX.
         Masters 0 .. 15 are ordered from left to right, i.e., from most to least
       significant. The relevant masters are the three cores, DMA and Ethernet0: M0, M1,
       M2, M4, M5, M8, M9, M10. In this sample, we don't use the other bus masters
       (security core and certain I/O devices) and for now, they don't get access.
         Ethernet0 is seen as a user. We define WORD2 such, that it grants full access
       rights for Ethernet, disregarding the argument of macro RGD_WRD2 and thus generally
       for all RAM. This is uncritical insofar as user code has no access to the
       configuration and behavior of the Ethernet device. However, the Ethernet driver
       needs to take care by software that user specified RAM addresses are explicitly
       checked prior to configuring its DMA.
         Remark: We use two overlapping regions for most RAM. One spans all of the RAM and
       grants read access to anybody (and write access to OS code), the other ones relate
       to small areas, which grant write access to one of the processes. This technique
       makes it difficult to get cache inhibitted RAM: The large global read access area
       must of course not disable the cache and -- since CI=1 has lower priority than CI=0
       (see RM 21.4.2, p. 506) -- this can't be altered by the overlapping area. To provide
       cached and uncached RAM we split the large global read area into two MPU areas. */
#define WORD3_ACCESS_SET_RAM                RGD_WRD3(074u, 077u, 076u, /* CI */ 0u)
#define WORD3_ACCESS_SET_RAM_CI             RGD_WRD3(074u, 077u, 076u, /* CI */ 1u)
#define WORD2_ALL_RAM                       RGD_WRD2(/* idxPattern */ 1u)
#define WORD2_PROCESS_RAM                   RGD_WRD2(/* idxPattern */ 2u)
#define WORD2_SHARED_RAM                    RGD_WRD2(/* idxPattern */ 3u)
#define WORD3_ACCESS_SET_ROM_PERIPHERALS    RGD_WRD3(055u, 060u, 050u, /* CI */ 0u)
#define WORD2_ALL_ROM                       RGD_WRD2(/* idxPattern */ 1u)
#define WORD2_PERIPHERALS                   RGD_WRD2(/* idxPattern */ 2u)
#define WORD2_RESERVED_BLOCK                RGD_WRD2(/* idxPattern */ 3u) /* See below */

    /* Support macro for sake of readability of code below: One particular access pattern
       is applied to all bus masters. */
    #define RGD_WRD2(idxPattern) ((((idxPattern)&0x3u)<<(15*2))   /* M0 */  \
                                  | (((idxPattern)&0x3u)<<(14*2)) /* M1 */  \
                                  | (((idxPattern)&0x3u)<<(13*2)) /* M2 */  \
                                  | (((idxPattern)&0x3u)<<(11*2)) /* M4 */  \
                                  | (((    3u    )&0x3u)<<(10*2)) /* M5 */  \
                                  | (((idxPattern)&0x3u)<<(7*2))  /* M8 */  \
                                  | (((idxPattern)&0x3u)<<(6*2))  /* M9 */  \
                                  | (((idxPattern)&0x3u)<<(5*2))  /* M10 */ \
                                 )

    /* Macro to form the WORD 3 of a region descriptor from the up to three access
       patterns. Note, cache inhibit must not be used because we have overlapping regions
       defined. See 21.3.10. */
    #define RGD_WRD3(accset1, accset2, accset3, cacheInhibit)                               \
                ((((accset1)&0x3fu)<<26) | (((accset2)&0x3fu)<<20) | (((accset3)&0x3fu)<<14)\
                 | ((/*FMT*/ 1u)<<4) | (((cacheInhibit)&1u)<<1)                             \
                )

    /* Macro for readability of code below: Construct region descriptor word 4 from the
       field values, we are interested in. (The PID mask doesn't care in our code and is
       generally set to "all PID bits matter".) See RM 21.3.11.
         PID 0 menas the kernel process. The differentiation between kernel and user
       processes is however not made by PID but by SV vs. user mode. Therefore, we take
       PID=0 in this macro as switch for disabling PID comparison.
         Note, only the cores access memory with a PID. For all other masters the PID
       condition is always true (RM 21.4.1.1, p. 504f). */
    #define WORD4_PIT_AWARE(pid)        (((pid)<<24) | ((pid)>0? 1u: 0u))
    #define WORD4_NO_PID_COMPARISON     (0u)

    /* Region descriptor, word 5: We use one and the same value for all of them: The
       descriptor is enabled and locked against any future change. */
    #define WORD5_LOCK_AND_ENABLE       (SMPU_WORD5_LCK(3) | SMPU_WORD5_VLD(1))

    unsigned int r = 0;

#if !defined(LINK_IN_RAM) /* See below, RAM configuration, otherwise */
    /* We consider the entire flash ROM, as far as used in this sample, as one memory
       region. We use linker defined symbols to find the boundaries. They need to be
       aligned compatible with the constraints of the SMPU. All start and end addresses
       have a granularity of 16 Byte. By hardware, the least significant four bits of a
       start address are set to zero and to all ones for an end address. This requires
       according alignment operations in the linker script. This is checked by assertion. */
    extern uint8_t ld_romStart[0], ld_romEnd[0];
    assert(((uintptr_t)ld_romStart & 0xf) == 0  &&  ((uintptr_t)ld_romEnd & 0xf) == 0);

    /* All used flash ROM.
         All masters and processes (i.e., user mode code) get full read and execute rights.
       Write access is forbidden in order to detect programming errors. */
    SMPU_0->RGD[r].WORD0    = (uintptr_t)ld_romStart;   /* Start address of region. */
    SMPU_0->RGD[r].WORD1    = (uintptr_t)ld_romEnd-1;   /* End address of region, including. */
    SMPU_0->RGD[r].WORD2.F1 = WORD2_ALL_ROM;
    SMPU_0->RGD[r].WORD3    = WORD3_ACCESS_SET_ROM_PERIPHERALS;
    SMPU_0->RGD[r].WORD4    = WORD4_NO_PID_COMPARISON;
    SMPU_0->RGD[r].WORD5    = WORD5_LOCK_AND_ENABLE;    /* Enable region descriptor. */
    ++ r;
#endif

    /* All peripheral address space (256MB) except for last 16k block, labeled "Reserved"
       in RM 3.6.1, Table 3-5, p. 133.
         All masters get read and write access in supervisor mode. The processes running in
       user mode don't get access. */
    SMPU_0->RGD[r].WORD0    = 0xf0000000u;          /* Start address of region. */
    SMPU_0->RGD[r].WORD1    = 0xffffc000u - 1u;     /* End address of region, including. */
    SMPU_0->RGD[r].WORD2.F1 = WORD2_PERIPHERALS;
    SMPU_0->RGD[r].WORD3    = WORD3_ACCESS_SET_ROM_PERIPHERALS;
    SMPU_0->RGD[r].WORD4    = WORD4_NO_PID_COMPARISON;
    SMPU_0->RGD[r].WORD5    = WORD5_LOCK_AND_ENABLE;/* Enable region descriptor. */
    ++ r;

    /* The last 16k block in the peripheral address space, labeled "Reserved" in RM 3.6.1,
       Table 3-5, p. 133, seems to be accessed by instruction reads. This is not documented
       but has been seen in the debugger. Most likely, it even is a side effect of setting
       break points in the debugger at critical code points and will not happen in normal
       code execution. A critical point was a breakpoint at the beginning of the IVOR #1
       handler. The MPU protection exception was followed by an immediate second one, when
       the breakpoint was hit; an instruction read at 0xffffc004 was tried but rejected by
       the MPU (peripheral space has no execution access rights). This immediate second
       exception destroyed the MCSRRi registers and disable code continuation after the
       break.
         As a counter measure, all masters get read and excution access rights in
       supervisor mode. The processes running in user mode still don't get any access. This
       can only partly avoid the effect.
         The effect appears only if the debugger is asked to display the related registers
       at a break, e.g., MCSSR0. If this display is not demanded then the code execution can
       be safely continued. */
    SMPU_0->RGD[r].WORD0    = 0xffffc000u;          /* Start address of region. */
    SMPU_0->RGD[r].WORD1    = 0xffffffffu;          /* End address of region, including. */
    SMPU_0->RGD[r].WORD2.F1 = WORD2_RESERVED_BLOCK;
    SMPU_0->RGD[r].WORD3    = WORD3_ACCESS_SET_ROM_PERIPHERALS;
    SMPU_0->RGD[r].WORD4    = WORD4_NO_PID_COMPARISON;
    SMPU_0->RGD[r].WORD5    = WORD5_LOCK_AND_ENABLE;/* Enable region descriptor. */
    ++ r;

