PeterVranken/DEVKIT-MPC5748G/samples/TCP/code/system/RTOS/rtos_systemMemoryProtectionUnit.c
    /* End of configuration of SMPU0 for ROM and peripherals. */
    assert(r <= 16);
    r = 0;

    /// @todo TBC: Does DMA use SV rights? Otherwise don't handle all masters same
    /* All used SRAM for operating system kernel and processes.
         All masters and the kernel have full access (RWX) for all used RAM. The processes
       have general read access. (They get write and execute rights only to their own
       portion of RAM, which is specified in different region descriptors.)
         The entire used RAM is split in two: We have a cached and an uncached portion. The
       latter degrades system performance but is still useful for simple cross-core
       communication.
         We use linker defined symbols to find the boundaries of the regions. In the linker
       script, they need to be aligned compatible with the constraints of the MPU. This is
       checked by assertion. */
    extern uint8_t ld_cachedRamStart[0], ld_cachedRamEnd[0];
    assert(((uintptr_t)ld_cachedRamStart & 0xf) == 0
           &&  ((uintptr_t)ld_cachedRamEnd & 0xf) == 0
          );
    SMPU_1->RGD[r].WORD0    = (uintptr_t)ld_cachedRamStart;/* Start address of region. */
    SMPU_1->RGD[r].WORD1    = (uintptr_t)ld_cachedRamEnd-1;/* End address of region, incl. */
    SMPU_1->RGD[r].WORD2.F1 = WORD2_ALL_RAM;
    SMPU_1->RGD[r].WORD3    = WORD3_ACCESS_SET_RAM;
    SMPU_1->RGD[r].WORD4    = WORD4_NO_PID_COMPARISON;
    SMPU_1->RGD[r].WORD5    = WORD5_LOCK_AND_ENABLE;    /* Enable region descriptor. */
    ++ r;
    extern uint8_t ld_uncachedRamStart[0], ld_uncachedRamEnd[0];
    assert(((uintptr_t)ld_uncachedRamStart & 0xf) == 0
           &&  ((uintptr_t)ld_uncachedRamEnd & 0xf) == 0
          );
    SMPU_1->RGD[r].WORD0    = (uintptr_t)ld_uncachedRamStart;/* Start address of region. */
    SMPU_1->RGD[r].WORD1    = (uintptr_t)ld_uncachedRamEnd-1;/* End address of region, incl. */
    SMPU_1->RGD[r].WORD2.F1 = WORD2_ALL_RAM;
    SMPU_1->RGD[r].WORD3    = WORD3_ACCESS_SET_RAM_CI;
    SMPU_1->RGD[r].WORD4    = WORD4_NO_PID_COMPARISON;
    SMPU_1->RGD[r].WORD5    = WORD5_LOCK_AND_ENABLE;    /* Enable region descriptor. */
    ++ r;

    /* It would be very easy to offer a compile time switch to select a hierarchical memory
       access model, where process with ID i has write access to the memory of process with
       ID j if i>=j. This will require just a few alternative lines of code here. All
       processes would use ld_sdaP1Start, ld_sda2P1Start and ld_dataP1Start instead of
       ld_sdaPiStart, ld_sda2PiStart and ld_dataPiStart, respectively, in their
       descriptors.
         The reason not to do so is the huge amount of additional testing, which would be
       required. */

#if RTOS_DISARM_RAM_MPU == 1
/// @todo TBC: It looks as if we would disable the cache inhibit area by defining all RAM in one area. Shouldn't we see two areas in this block?
    /* Full rwx access rights for all used RAM for all user processes. Here, we disable the
       PID awareness. */
    extern uint8_t ld_ramStart[0], ld_ramEnd[0];
    assert(((uintptr_t)ld_ramStart & 0xf) == 0  &&  ((uintptr_t)ld_ramEnd & 0x0f) == 0);
    SMPU_1->RGD[r].WORD0 = (uintptr_t)ld_ramStart;  /* Start address of region. */
    SMPU_1->RGD[r].WORD1 = (uintptr_t)ld_ramEnd-1;  /* End address of region, including. */
    SMPU_1->RGD[r].WORD2 = WORD2_PROCESS_RAM;
    SMPU_1->RGD[r].WORD3 = WORD3_ACCESS_SET_RAM;
    SMPU_1->RGD[r].WORD4 = WORD4_NO_PID_COMPARISON;
    SMPU_1->RGD[r].WORD5 = WORD5_LOCK_AND_ENABLE;   /* Enable region descriptor. */
    ++ r;
#else
    /* RAM access for process i. */
#define CONFIG_REGIONS_PROC_RAM(pid)                                                \
        {                                                                           \
            CONFIG_REGION_DESC_PROC_RAM(pid, /* section */ data, /* CI? (no) */)    \
            CONFIG_REGION_DESC_PROC_RAM(pid, /* section */ sda , /* CI? (no) */)    \
            CONFIG_REGION_DESC_PROC_RAM(pid, /* section */ sda2, /* CI? */ _CI)     \
        }

/// @todo Many (sda) regions are empty. Use an if to avoid spending a descriptor: This makes it particularly easy to have more than 4 processes by intentionally not using sda2
#define CONFIG_REGION_DESC_PROC_RAM(pid, section, CI)                                       \
        {                                                                                   \
            extern uint8_t ld_##section##P##pid##Start[0], ld_##section##P##pid##End[0];    \
            assert(((uintptr_t)ld_##section##P##pid##Start & 0xf) == 0                      \
                   &&  ((uintptr_t)ld_##section##P##pid##End & 0xf) == 0                    \
                  );                                                                        \
            SMPU_1->RGD[r].WORD0    = (uintptr_t)ld_##section##P##pid##Start;/* from */     \
            SMPU_1->RGD[r].WORD1    = (uintptr_t)ld_##section##P##pid##End-1;/* to, incl. */\
            SMPU_1->RGD[r].WORD2.F1 = WORD2_PROCESS_RAM;                                    \
            SMPU_1->RGD[r].WORD3    = WORD3_ACCESS_SET_RAM##CI;                             \
            SMPU_1->RGD[r].WORD4    = WORD4_PIT_AWARE(pid);                                 \
            SMPU_1->RGD[r].WORD5    = WORD5_LOCK_AND_ENABLE;/* Enable region descriptor. */ \
            ++ r;                                                                           \
        }

    CONFIG_REGIONS_PROC_RAM(/* pid */ 1)
    CONFIG_REGIONS_PROC_RAM(/* pid */ 2)
    CONFIG_REGIONS_PROC_RAM(/* pid */ 3)
    CONFIG_REGIONS_PROC_RAM(/* pid */ 4)

#undef CONFIG_REGIONS_PROC_RAM
#undef CONFIG_REGION_DESC_PROC_RAM

    /* A shared memory area. All processes can write. This area is a subset of (or overlays
       with, respectively) the uncached RAM. */
    extern uint8_t ld_dataSharedStart[0], ld_dataSharedEnd[0];
    assert(((uintptr_t)ld_dataSharedStart & 0xf) == 0
           &&  ((uintptr_t)ld_dataSharedEnd & 0xf) == 0
          );
    SMPU_1->RGD[r].WORD0    = (uintptr_t)ld_dataSharedStart;/* Start address data + bss */
    SMPU_1->RGD[r].WORD1    = (uintptr_t)ld_dataSharedEnd-1;/* End address, including. */
    SMPU_1->RGD[r].WORD2.F1 = WORD2_SHARED_RAM;
    SMPU_1->RGD[r].WORD3    = WORD3_ACCESS_SET_RAM_CI;
    SMPU_1->RGD[r].WORD4    = WORD4_NO_PID_COMPARISON;
    SMPU_1->RGD[r].WORD5    = WORD5_LOCK_AND_ENABLE;        /* Enable region descriptor. */
    ++ r;

#endif /* RTOS_DISARM_RAM_MPU */

#if defined(LINK_IN_RAM) /* See above, ROM/peripherals configuration, otherwise */
    /* We consider the entire text and constant data segment, as far as used in this
       sample, as one memory region. We use linker defined symbols to find the boundaries.
       They need to be aligned compatible with the constraints of the SMPU. All start and
       end addresses have a granularity of 16 Byte. By hardware, the least significant four
       bits of a start address are set to zero and to all ones for an end address. This
       requires according alignment operations in the linker script. This is checked by
       assertion. */
    extern uint8_t ld_romStart[0], ld_romEnd[0];
    assert(((uintptr_t)ld_romStart & 0xf) == 0  &&  ((uintptr_t)ld_romEnd & 0xf) == 0);

    /* All used flash ROM contents, however held in RAM.
         All masters and processes (i.e., user mode code) get full read and execute rights.
       Write access is forbidden in order to detect programming errors. */
    SMPU_1->RGD[r].WORD0    = (uintptr_t)ld_romStart;   /* Start address of region. */
    SMPU_1->RGD[r].WORD1    = (uintptr_t)ld_romEnd-1;   /* End address of region, including. */
    SMPU_1->RGD[r].WORD2.F1 = WORD2_ALL_ROM;
    SMPU_1->RGD[r].WORD3    = WORD3_ACCESS_SET_ROM_PERIPHERALS;
    SMPU_1->RGD[r].WORD4    = WORD4_NO_PID_COMPARISON;
    SMPU_1->RGD[r].WORD5    = WORD5_LOCK_AND_ENABLE;    /* Enable region descriptor. */
    ++ r;
#endif

    assert(r <= 16);

