PeterVranken/DEVKIT-MPC5748G/samples/TCP/code/system/RTOS/rtos_systemMemoryProtectionUnit.c
    /* RM 21.3.1, p. 491: After configuring all region descriptors, we can globally enable
       both MPUs. */
    SMPU_0->CES0 = SMPU_CES0_MERR(0xffff)   /* Reset all possibly pending errors. */
                   | SMPU_CES0_GVLD(1);     /* Globally enable the MPU. */
    SMPU_1->CES0 = SMPU_CES0_MERR(0xffff)   /* Reset all possibly pending errors. */
                   | SMPU_CES0_GVLD(1);     /* Globally enable the MPU. */

} /* End of rtos_osInitMPU */




/**
 * Helper function, mainly intended to support safe system call handler implementation:
 * Check if a pointer value is valid for writing in the context of a given process.\n
 *   A system call handler must never trust a user code provided pointer; evidently not for
 * write access but not even for read operation (a read into the address space of
 * peripherals can have a side effect). The user code could make the system call handler
 * overwrite some non-process owned data objects, cause an access violation in the
 * supervisor code or manipulate some peripherals.\n
 *   Normally, it's strongly disencouraged having pointers as arguments of system calls at
 * all. If not avoidable, one can use this helper function to check that a pointer points
 * into permitted address space and that all bytes of a data object pointed at are still in
 * that address space. Here for write access.\n
 *   Permitted address space is anywhere, where the process may write without causing an
 * exception or any kind of side effect. In particular, this means the process' own RAM and
 * the shared RAM.
 *   @return
 * Get \a true if the pointer may be used for write access and \a false otherwise.
 *   @param PID
 * The ID of the process the query relates to. Range is 1..4.
 *   @param address
 * The pointer value, or the beginning of the chunk of memory, which needs to be entirely
 * located in writable memory.
 *   @param noBytes
 * The size of the chunk of memory to be checked. Must not be less than one. (Checked by
 * assertion).
 *   @remark
 * The counterpart function rtos_checkUserCodeReadPtr() is implemented as inline function
 * in the RTOS API header file, rtos.h.
 *   @remark
 * Although this function is intended for use inside a system call handler it can be safely
 * used from user code, too.
 */
bool rtos_checkUserCodeWritePtr(unsigned int PID, const void *address, size_t noBytes)
{
    const uint8_t * const p = (uint8_t*)address;

    /* The function doesn't support the kernel process with ID zero. We consider the index
       offset by one. */
    const unsigned int idxP = PID-1;
    if(idxP >= RTOS_NO_PROCESSES)
        return false;

    /* All relevant RAM areas are defined in the linker script. We can access the
       information by declaring the linker defined symbols. */

#if RTOS_DISARM_RAM_MPU == 1
    extern uint8_t ld_ramStart[0], ld_ramEnd[0];
    return p >= ld_ramStart  &&  p+noBytes <= ld_ramEnd;
#else
    extern uint8_t ld_dataSharedStart[0], ld_dataSharedEnd[0];
    if(p >= ld_dataSharedStart  &&  p+noBytes <= ld_dataSharedEnd)
        return true;

    extern uint8_t ld_sdaP1Start[0], ld_sdaP1End[0]
                 , ld_sda2P1Start[0], ld_sda2P1End[0]
                 , ld_dataP1Start[0], ld_dataP1End[0];

    extern uint8_t ld_sdaP2Start[0], ld_sdaP2End[0]
                 , ld_sda2P2Start[0], ld_sda2P2End[0]
                 , ld_dataP2Start[0], ld_dataP2End[0];

    extern uint8_t ld_sdaP3Start[0], ld_sdaP3End[0]
                 , ld_sda2P3Start[0], ld_sda2P3End[0]
                 , ld_dataP3Start[0], ld_dataP3End[0];

    extern uint8_t ld_sdaP4Start[0], ld_sdaP4End[0]
                 , ld_sda2P4Start[0], ld_sda2P4End[0]
                 , ld_dataP4Start[0], ld_dataP4End[0];

    #define from    0
    #define to      1

    #define SDA     0
    #define SDA2    1
    #define DATA    2

    #define addrAry(prc, boundary)                  \
                { [SDA]  = ld_sda##prc##boundary    \
                , [SDA2] = ld_sda2##prc##boundary   \
                , [DATA] = ld_data##prc##boundary   \
                }
    #define addrPrcAryAry(prc)   {[from] = addrAry(prc, Start), [to] = addrAry(prc, End)}

    static const uint8_t * const RODATA(ramAreaAryAryAry_)[/* idxP */ RTOS_NO_PROCESSES]
                                                          [/* from/to */ 2]
                                                          [/* Area */ 3] =
                                                            { [/*idxP*/ 0] = addrPrcAryAry(P1)
                                                            , [/*idxP*/ 1] = addrPrcAryAry(P2)
                                                            , [/*idxP*/ 2] = addrPrcAryAry(P3)
                                                            , [/*idxP*/ 3] = addrPrcAryAry(P4)
                                                            };
    return p >= ramAreaAryAryAry_[idxP][from][SDA]
           &&  p+noBytes <= ramAreaAryAryAry_[idxP][to][SDA]
           ||  p >= ramAreaAryAryAry_[idxP][from][SDA2]
               &&  p+noBytes <= ramAreaAryAryAry_[idxP][to][SDA2]
           ||  p >= ramAreaAryAryAry_[idxP][from][DATA]
               &&  p+noBytes <= ramAreaAryAryAry_[idxP][to][DATA];

    #undef from
    #undef to
    #undef SDA
    #undef SDA2
    #undef DATA
    #undef addrAry
    #undef addrPrcAryAry
#endif
} /* End of rtos_checkUserCodeWritePtr */



